spec/support/vcr_cassettes/run_checkout_organizer_with_promo_reconciliation.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/transfers
    body:
      encoding: US-ASCII
      string: amount=2000&currency=usd&description=Reconciliation+for+Promo+ID+%231&destination=acct_17kfh1GUzmmEZmmK
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer sk_test_4VObNRAiXCBixyd9lpO2sdeP
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.2.0 p0 (2014-12-25)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.1.13-boot2docker (root@11aafb97cfeb) (gcc version 4.9.2 (Debian
        4.9.2-10) ) #1 SMP Fri Nov 20 19:05:50 UTC 2015","hostname":"cb19fd816d4c"}'
      Content-Length:
      - '103'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 02 Mar 2016 23:15:17 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '846'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_80kgMZEvqa1XMI
      Stripe-Version:
      - '2015-08-19'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tr_17kjBY4Iy02hWvBEM0JeyeZV",
          "object": "transfer",
          "amount": 2000,
          "amount_reversed": 0,
          "application_fee": null,
          "balance_transaction": "txn_17kjBY4Iy02hWvBEi6XKa5m2",
          "created": 1456960516,
          "currency": "usd",
          "date": 1456960516,
          "description": "Reconciliation for Promo ID #1",
          "destination": "acct_17kfh1GUzmmEZmmK",
          "destination_payment": "py_17kjBYGUzmmEZmmKnLe5Apo7",
          "failure_code": null,
          "failure_message": null,
          "livemode": false,
          "metadata": {},
          "recipient": null,
          "reversals": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/transfers/tr_17kjBY4Iy02hWvBEM0JeyeZV/reversals"
          },
          "reversed": false,
          "source_transaction": null,
          "source_type": "card",
          "statement_descriptor": null,
          "status": "paid",
          "type": "stripe_account"
        }
    http_version: 
  recorded_at: Wed, 02 Mar 2016 23:15:17 GMT
recorded_with: VCR 3.0.1
